IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/DCC0_DCC0.xml
<module name="DCC0_DCC0" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="DCC0_DCCGCTRL" acronym="DCC0_DCCGCTRL" offset="0x0" width="32" description="">
		<bitfield id="DONENA" width="4" begin="15" end="12" resetval="0x5" description="The DONEENA bit enables/disables the done signal. 0101 =  disabled &#38; 1010 = enabled" range="15 - 12" rwaccess="RW"/> 
		<bitfield id="SINGLESHOT" width="4" begin="11" end="8" resetval="0x5" description="Single/Continuous checking mode. 0101 = Continuous &#38; 1010 =  Single" range="11 - 8" rwaccess="RW"/> 
		<bitfield id="ERRENA" width="4" begin="7" end="4" resetval="0x5" description="The ERRENA bit enables/disables the error signal. 0101 =  disabled &#38; 1010 = enabled" range="7 - 4" rwaccess="RW"/> 
		<bitfield id="DCCENA" width="4" begin="3" end="0" resetval="0x5" description="The DCCENA bit starts and stops the operation of the dcc  0101 = disabled &#38; 1010 = enabled" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="DCC0_DCCREV" acronym="DCC0_DCCREV" offset="0x4" width="32" description="">
		<bitfield id="SCHEME" width="3" begin="30" end="28" resetval="0x4" description="SCHEME. - (RO  )" range="30 - 28" rwaccess="RO"/> 
		<bitfield id="FUNC" width="12" begin="25" end="14" resetval="0x0" description="Functional release number - (RO  )" range="25 - 14" rwaccess="RO"/> 
		<bitfield id="RTL" width="5" begin="13" end="9" resetval="0x1" description="Design Release Number - (RO  )" range="13 - 9" rwaccess="RO"/> 
		<bitfield id="MAJOR" width="3" begin="8" end="6" resetval="0x0" description="Major Revision Number - (RO  )" range="8 - 6" rwaccess="RO"/> 
		<bitfield id="CUSTOM" width="1" begin="5" end="5" resetval="0x0" description="Indicates a special version of the module. May not be  supported  by standard software - (RO  )" range="5" rwaccess="RO"/> 
		<bitfield id="MINOR" width="5" begin="4" end="0" resetval="0x4" description="Minor revision number. - (RO  )" range="4 - 0" rwaccess="RO"/>
	</register>
	<register id="DCC0_DCCCNTSEED0" acronym="DCC0_DCCCNTSEED0" offset="0x8" width="32" description="">
		<bitfield id="COUNTSEED0" width="20" begin="19" end="0" resetval="0x0" description="The seed value for Counter 0. The seed value that gets  loaded into counter 0 (clock  source 0)" range="19 - 0" rwaccess="RW"/>
	</register>
	<register id="DCC0_DCCVALIDSEED0" acronym="DCC0_DCCVALIDSEED0" offset="0xC" width="32" description="">
		<bitfield id="VALIDSEED0" width="16" begin="15" end="0" resetval="0x0" description="The seed value for Valid Duration Counter 0.The seed value  that gets loaded into the valid duration counter for clock  source 0" range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="DCC0_DCCCNTSEED1" acronym="DCC0_DCCCNTSEED1" offset="0x10" width="32" description="">
		<bitfield id="COUNTSEED1" width="20" begin="19" end="0" resetval="0x0" description="The seed value for Counter 1. The seed value that gets  loaded into counter 1 (clock  source 1" range="19 - 0" rwaccess="RW"/>
	</register>
	<register id="DCC0_DCCSTAT" acronym="DCC0_DCCSTAT" offset="0x14" width="32" description="">
		<bitfield id="DONE" width="1" begin="1" end="1" resetval="0x0" description="Indicates whether or not an done has occured. Writing a 1 to this bit clears  the flag." range="1" rwaccess="RW"/> 
		<bitfield id="ERR" width="1" begin="0" end="0" resetval="0x0" description="Indicates whether or not an error has occured. Writing a 1 to this bit clears  the flag." range="0" rwaccess="RW"/>
	</register>
	<register id="DCC0_DCCCNT0" acronym="DCC0_DCCCNT0" offset="0x18" width="32" description="">
		<bitfield id="COUNT0" width="20" begin="19" end="0" resetval="0x0" description="This field contains the current value of counter 0. - (RO   )" range="19 - 0" rwaccess="RO"/>
	</register>
	<register id="DCC0_DCCVALID0" acronym="DCC0_DCCVALID0" offset="0x1C" width="32" description="">
		<bitfield id="VALID0" width="16" begin="15" end="0" resetval="0x0" description="This field contains the current value of valid counter 0. -  (RO  )" range="15 - 0" rwaccess="RO"/>
	</register>
	<register id="DCC0_DCCCNT1" acronym="DCC0_DCCCNT1" offset="0x20" width="32" description="">
		<bitfield id="COUNT1" width="20" begin="19" end="0" resetval="0x0" description="This field contains the current value of counter 1. - (RO   )" range="19 - 0" rwaccess="RO"/>
	</register>
	<register id="DCC0_DCCCLKSSRC1" acronym="DCC0_DCCCLKSSRC1" offset="0x24" width="32" description="">
		<bitfield id="KEY_B4" width="4" begin="15" end="12" resetval="0x5" description="Key Programing (1010 is the KEY Value)" range="15 - 12" rwaccess="RW"/> 
		<bitfield id="CLK_SRC1" width="4" begin="3" end="0" resetval="0x0" description="Clock source selection for Source 0DCC-A Clock source-0 selection Program value and its respective clock selected  0x0 - REF_CLK0x1 - CPU_CLK0x2 - RC_CLK0x3 - RC_CLK0x4 - RC_CLK0x5 - RC_CLK0x6 - RC_CLK0x7 - RC_CLKDCC-B Clock source-0 selection Program value and its respective clock selected  0x0 - VCLK0x1 - DSS_CLK0x2 - BSS_CLK0x3 - QSPI_CLK0x4 - FDCAN_CLK0x5 - REF_CLK0x6 - CPU_CLK0x7 - RC_CLK" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="DCC0_DCCCLKSSRC0" acronym="DCC0_DCCCLKSSRC0" offset="0x28" width="32" description="">
		<bitfield id="CLK_SRC0" width="4" begin="3" end="0" resetval="0x5" description="Clock source selection for Source 0DCC-A Clock source-0 selection Program value and its respective clock selected  0 - REF_CLKA - PLL_6005 - PLL_240DCC-B Clock source-0 selection Program value and its respective clock selected  0 - PLL_600A - VCLK5 - CPU_CLK" range="3 - 0" rwaccess="RW"/>
	</register>
</module>